{
    "job_titles" : {
        "BD" : "Becoming a board member is no easy task. To be a board member is to ensure the balance and fairness within the workplace from all corners. A board members job is to collect feedback from all employees, and compile them into reasonable lists to show at each board meeting. Board Members are also responsible for decision making dealing with shareholders. Decisions based around hiring, or firing, senior executives, dividend policies, options policies, and executive compensation. You also help the corporation set broad goals, supporting executive duties, and ensuring the company has adequate, well-managed resources at its disposal. Essentially, The Board of Directors is responsible for oversight of management's actions to ensure that the company's vision is being adhered to. This position has a base salary of $90,000 annually, and also has 5 year performance reviews. The Board of Directors, and Any Other Employees Within KasMek, LLC are subject to be terminated at any time for any reason by either of the owners of KasMek, LLC.",
        "CEO" : "The CEO is the position of most authority in an organization. They set the vision and north star for the company, and they really everybody around a common understanding of why the company exists, it's mission, and values. CEO's are often the public face of the company, and sometimes become synonymous with the brand.",
        "CTO" : "Like the CEO role, the CTO role shape-shifts over time. At young startups, the CTO is often a technical cofounder to a visionary or domain-driven CEO. Frequently they are not qualified to take the title at a larger company, and hopefully grow into it as the company grows. Frequently, a startup CTO finds that they prefer more technical engineering roles, and settle back into other roles, like Principal Engineer, VP of Engineering, or Chief Architect. In many organizations, the mature CTO role is outward facing. They participate in business development meetings, frequently helping to land large partnerships or sales. Many of them hit the conference circuit and spend a lot of time evangelizing the development activities of the organization to the wider world: sharing the company’s innovations and discovering opportunities in the market which match up well with the company’s core competencies. CTOs frequently work closely with the product team on product strategy, and often have an internal-facing counterpart in engineering, such as the VP of Engineering. CTOs also frequently set the vision and north star of the engineering team. The goals for the team to work towards.",
        "CIO" : "The Chief Innovation Officer (CIO) is like a CTO, but typically employed by a company that would not normally be considered a “tech company”. The goal of the CIO is to reshape the company into one that consumers perceive as tech-savvy and innovative: To show the world what the future of the industry looks like, no matter what that industry is. For example, a home remodeling superstore chain might have a CIO responsible for partnering with tech companies to build a mixed reality app to show shoppers what a specific couch or wall color would look like in their living room, or using blockchains and cryptocurrencies to enhance the security and efficiency of supply chain logistics. Not to be confused with a Chief Information Officer (CIO), a title which is typically used in companies who are even more detached from technology, interested about as far as it aids their core operations. Unlike a Chief Innovation Officer, A Chief Information Officer is more likely to be leading tech integration and data migration projects than building new apps and trying to figure out how a company can disrupt itself from the inside. There are Chief Information Officers who act more like Chief Innovation Officers, but in my opinion, they should use the appropriate title. Most tech-native companies (app developers, etc) don’t have either kind of CIO. Instead, those responsibilities fall to the CTO and VP of Engineering.",
        "VPE" : "While CTOs often face outward, the VP of Engineering often faces inward. A VP of Engineering is frequently responsible for building the engineering team and establishing the engineering culture and operations. The CTO might tell the engineering team what needs to get done on the grand scale, e.g., “be the leading innovator in human/computer interaction”. The VP of Engineering helps foster a culture that manages the “how”. The best VPs of Engineering at first come across as somebody who’s there to help the team work efficiently, and then they almost disappear. Developers on the team collaborate well, mentor each other, communicate effectively, and they think, “Hey, we’re a great team. We work really well together!” and maybe they think that’s all a lucky accident. The truth is that almost never happens by accident. It happens because there’s a VP of Engineering constantly monitoring the team’s progress, process, culture, and tone of communications. They’re encouraging developers to use certain tools, hold specific kinds of meetings at specific times in order to foster better collaboration with fewer interruptions. The best VPs of Engineering have been engineers, both on dysfunctional teams, and on highly functional teams. They know the patterns and anti-patterns for effective software development workflows. They work with the heads of product and product managers to ensure that there’s a good product discovery process (they don’t lead it or take charge of it, just make sure that somebody is on it and doing it well), and that product and design deliverables are adequately reviewed by engineers prior to implementation hand offs. I’m going to stop there before I write a book on all the work that goes into leading effective development operations. For more of my thoughts on this topic, check out How to Build a High Velocity Development Team. Many startups are too small to hire a full time VP of Engineering, but it’s still very important to get engineering culture right as early as possible. If you need help with this, reach out.",
        "VPM" : "As the Vice President of Marketing you are responsible for all things marketing related. Your job is to ensure that all marketing areas of the marketing department are meeting deadlines, criteria requriements, and you are the one who brings those marketing plans to the meetings. You ensure proper, and fair work flow within your department. This job has a base salary of $89,000 and 4 year performance reviews",
        "VPPM" : "As the Vice President of Project Management you are resposible for the design and developement practices, process, and policies on project management to ensure that it lines up with corporate goals and strategies. You ensure resource allocations, including developers, QA engineers, architectures, business analysts. This job has a starting base salary of $88,000 annually, and performance reviews become every 5 years.",
        "EPM" : "An Engineering Project Manager (also called “Engineering Manager” or simply “Project Manager”) is in charge of managing the workflow of an engineering team. Some larger companies have both Engineering Managers and Project Managers. In that case, the Engineering Manager typically acts like the VP of Engineering at the local team scope, while the Project Manager takes on the responsibilities described here. Project Managers typically interface with both product leaders and an engineering leader such as VP of Engineering, CTO, or a middle manager to cultivate and prune the work backlogs, track the progress of work tickets, detailed progress reports (milestone burn down charts, completed vs open tickets, month/month progress reports, etc.) You can think of them as the analog of a shop manager for a manufacturing assembly line. They watch the work floor and make sure that the assembly line runs smoothly, and work product isn’t piling up on the floor in front of a bottleneck. The best Project Managers also spend a lot of time classifying issues and bugs in order to analyze metrics like bug density per feature point, what caused the most bugs (design error, spec error, logic error, syntax error, type error, etc.) and so on. Those kinds of metrics can be used to measure the effectiveness of various initiatives, and point out where improvements can be made to the engineering process. Engineering Managers tend to develop a good understanding of the strengths of various team members, and get good at assigning work tickets to the appropriate responsible parties, although, this should be a collaborative effort, seeking feedback from individual developers on what their career goals are and what they want to focus on, within the bounds of the project scope available. If there is time pressure or work backlogs piling up, the Project Manager should collaborate with the engineering and product leaders to figure out the root cause and correct the dysfunction as soon as possible. Wherever possible, the Project Managers should be the only ones directly delegating tasks to individual engineers in order to avoid the multiple bosses problem. Engineers should have a clear idea of who they report directly to, and who’s in charge of delegating to them. If you’re a different kind of engineering leader, and you’re guilty of delegating directly to engineers, it’s probably a good idea to coordinate with the Engineering Manager in charge of the report you’re delegating to and delegate through them so that the work receives correct, coordinated prioritization, and the Engineering Manager is aware of what each engineer is actively working on at any given moment. At very small organizations, the Engineering Manager is often also the CTO and VP of Engineering (with or without the corresponding titles). If that’s you, don’t worry about the previous paragraph. A common dysfunction is that the Engineering Manager can begin to think that because product hands off work for engineering to implement, and Engineering Managers work closely with product teams, that the Engineering Manager reports to a Product Manager. In every case I’ve seen that happen, it was a mistake. This job has a base salary of $83,000 annually, and performance reviews become every 4 years.",
        "SSA" : "Becoming A Senior Software Architect means you become a bigger piece of the full pie. It means you get a company credit card (unavailable at this time), and you'll get your own office. You get a base salary of $75,000 annuallym, and performance reviews become once every 2 years. You will also be working as the assistant to the Chief Architects in ensuring the development accuracy, and deadline meetings for the project(s) currently at hand.",
        "SA" : "A software architect serves many of the purposes of a chief architect, but is generally responsible for smaller cross-sections of functionality. Architects will often work with the chief architect to implement their slice of the larger architectural vision. Software architects often make tech stack choices for particular applications or features, rather than company-wide decisions. This is now a base salary position that starts at $70,000 annually, and your performance reviews are now every 3rd quarter.",
        "PSE" : "As a Principal Software Engineer your job runs hand and hand with the marketing department. Your job is to help ensure that all software, and other items that KesMek, LLC may produce, are quailty check ready for their trials. Your yearly raises are dependent on your performance reviews. This is now a base salaray position that starts at $60,000 annually.",
        "SSE" : "Being a Senior Software Engineer/Developer means that you're the one carrying the energy for your departments. You set the vision for your areas, and ensure that the flow continues steadily. You are responsible for all employees, employee relations, schedule confirmations, etc. You are now in a position of management. Your raises are dependent on your performance reviews. This is now a base salary position that starts at $50,000 annually. Your performance reviews go from every 6 months to once a year.",
        "TL" : "The Tech Lead, Team Lead, or Engineering Lead is usually the leader of a small number of developement teams. They are usually senior engineers who act like mentors, examples, and guides for their teams. Usually, engineers report to the project manager or engineering manager, but a tech lead may be responsible for the team’s code quality measures, such as ensuring that adequate code reviews are being conducted, and that the team’s technical standards (such as TDD) are being upheld. Your quarterly raises are dependent on your semi-annual performance reviews.",
        "SE" : "As a Software Engineer/Developer you will be responsible for things relating to the software your team is developing. You are one of the main members of the team and you are in a more permanent position. Software Engineers are seen as the 'Leader' of the team they are assigned to, and thus are responsible for reviewing all files, scripts, etc. pertaining to their teams current project, and ensure deadlines are met with the most accurate submissions. This position has regular 3 month reviews, that if passed, may make you eligble for a $0.15 pay raise. Benefits to being in this position may include a flexible work schedule, or a work from home position given the circumstances. To see if you are eligble to work from home [click here]('')",
        "JSE" : "You made the step from Intern to a Full Time Employee. This now starts your career with KasMek, LLC. As a Junior Software Developer, you will be responsible for minor development projects. You will be assigned to a team as a junior, and will be responsible for completing small tasks that the Team Lead assigns to you. Once you have surpassed your 90 probationary period as a Junior Software Developer, you will be up for a performance review. Passing your performance reviews could offer things like: Pay Increase, Flexible Schedule, and/or a Promotion",
        "ISE" : "A “Fair Chance” job that tests if you would be a good fit as an applicant with gaps in their resume, or who have been out of the workforce for the past 6 months or more. KasMek, LLC is open to applicants who do not have a college diploma. This position is considered a temporary position, and may be terminated at any time for any reason. This position also has a 180 day probationary period (6 months) from the date of hire. You will be assigned to a team as an intern, and will be responsible for assisting the Software Developer that the Team Lead assigns you to. Once you have surpassed your 90 probationary period as an intern Software Developer, you will be up for a performance review. Passing your performance reviews could offer things like: Pay Increase, Flexible Schedule, and/or a Promotion"
    },
    "available" : {
        "Board Of Directors" : "available",
        "Chief Executive Officer" : "available",
        "Chief Technical Officer" : "available",
        "Chief Innovation Officer" : "available",
        "Chief Digital Officer" : "available",
        "Vice President of Engineering" : "available",
        "Director of Engineering" : "available",
        "Vice President of Marketing" : "available",
        "Vice President of Project Management" : "available",
        "Engineering Project Manager" : "available",
        "Engineering Manager" : "available",
        "Project Manager" : "available",
        "Chief Architect" : "available",
        "Senior Software Architect" : "available",
        "Software Architect" : "available",
        "Principal Software Engineer" : "available",
        "Senior Software Engineer" : "available",
        "Senior Software Developer" : "available",
        "Team Lead" : "available",
        "Tech Lead" : "available",
        "Software Engineer" : "available",
        "Software Developer" : "available",
        "Junior Software Developer" : "available",
        "Intern Software Developer" : "available"

    },
    "unavailable" : {
        "CA" : "At small organizations, the chief architect could be a technical co-founder with the self-awareness to realize that they won’t want the responsibilities of a CTO as the company grows. Maybe they don’t like to travel, or are simply more interested in software design than conference talks, business development, and sales calls that infiltrate the lives of many CTOs. The chief architect may be responsible for selecting technology stacks, designing collaborations and interfaces between computing systems, assessing compute services offerings (AWS, Azure, ZEIT Now, etc.), and so on. A chief architect may evaluate a wide range of industry offerings and make pre-approved or favored recommendations to work with particular vendors. As the company matures, the chief architect may also need to work closely with the CTO, and sometimes partner organizations to develop integrations between services. At many companies, the CTO also serves as the chief architect when the chief architect is unavailable. This job has a base salary of $80,000 annually, and performance reviews are every 3 years."
    }
}