{
    "1" : "Concentrate all your thoughts upon the work in hand. The sun's rays do no burn until brought to a focus\n- Alexander Graham Bell",
    "2" : "Either you run the day or the day runs you\n- Jim Rohn",
    "3" : " I'm a greater believer in luck, and I find the harder I work the more I have of it\n- Thomas Jefferson",
    "4" : "When we strive to become better than we are, everything around us becomes better too\n- Paulo Coelho",
    "5" : "Opportunity is missed by most people because it is dressed in overalls and looks like work\n- Thomas Edison",
    "6" : "You've got to get up every morning with determination if you're going to go to bed with satisfaction\n- George Lorimer",
    "7" : "Don't judge each day by the harvest you reap but by the seeds that you plant\n- Robert Louis Stevenson",
    "8" : "Just one small positive thought in the morning can change your whole day\n- Dalai Lama",
    "9" : "One of the best pieces of advice I ever got was from a horse master. He told me to go slow to go fast. I think that applies to everything in life. We live as though there aren't enough hours in the day but if we do each thing calmly and carefully we will get it done quicker and with much less stress\n- Viggo Mortensen",
    "10" : "Whether you think you can, or you think you can't - you're right\n- Henry Ford",
    "11" : "Time is an equal opportunity employer. Each human being has exactly the same number of hours and minutes every day. Rich people can't buy more hours. Scientists can't invent new minutes. And you can't save time to spend it on another day. Even so, time is amazingly fair and forgiving. No matter how much time you've wasted in the past, you still have an entire tomorrow\n- Denis Waitley",
    "12" : "Don't wish it were easier. Wish you were better\n- Jim Rohn",
    "13" : "Do the hard jobs first. The easy jobs will take care of themselves\n- Dale Carnegie",
    "14" : "Developing a good work ethis is key. Apply yourself at whatever you do, whether you're a janitor or taking your first summer job because that work ethic will be reflected in everything you do in life\n- Tyler Perry",
    "15" : "Happiness is not in the mere possession of money; it lies in the joy of achievement, in the thrill of creative effort\n- Franklin D. Roosevelt",
    "16" : "Success means doing the best we can with what we have. Success is the doing, not the getting; in the trying, not the triumph. Success is a personal standard, reaching for the highest that is in us, becoming all that we can be\n- Zig Ziglar",
    "17" : "The future depends on what you do today\n- Mahatma Gandhi",
    "18" : "Do more than is required. What is the distance between someone who achieves their goals consistently and those who spend their lives and careers merely following? The extra mile\n- Gary Ryan Blair",
    "19" : "The man who moves a mountain begins by carrying away small stones\n- Conficius",
    "20" : "Things may come to those who wait, but only things left by those who hustle\n- Abraham Lincoln"
}